DataProcessors/Церебро.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>Церебро</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Url</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>brief_description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>productID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>categoryID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>product_code</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>date_added</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>date_last_change</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>date_last_price_change</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>date_last_change_description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>warranty</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_archive</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_exclusive</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>vendorID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>articul</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>volume</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>weight</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>kbt</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_price_cut</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_distribution</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_new</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price_uah</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>recommendable_price</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>retail_price_uah</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>bonus</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>self_delivery</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>small_image</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>medium_image</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>large_image</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>full_image</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity_package_sale</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>koduktved</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name_ua</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name_ru</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопСвойстваJSON</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>categoryID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>parentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Производители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияCerebro</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииCerebro</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>vendorID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДополнительнойИнформацииОбъектов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиПодключенияКAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКAPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДопСвойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПроизводителиCerebro.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПроизводителиCerebro</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияCerebro</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииCerebro</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Церебро/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;


Процедура Залогиниться() Экспорт
	
	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("Cerebro");
	
	Url = СтрПодключение.Адрес;
	Логин = СтрПодключение.Логин;
	Пароль = СтрПодключение.Пароль;
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(Пароль);
	
	Пароль = СтрЗаменить(Строка(Хеш.ХешСумма), " ", ""); 
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	стрАунтефикация = Новый Структура; 
	стрАунтефикация.Вставить("login", Логин);
	стрАунтефикация.Вставить("password", Пароль);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();  
	ЗаписатьJSON(ЗаписьJSON, стрАунтефикация);            
	стрJSON = ЗаписьJSON.Закрыть();
	
	ВремКаталог = КаталогВременныхФайлов();
	
	ФайлОтправки = Новый ЗаписьТекста(ВремКаталог + "test.txt", КодировкаТекста.ANSI);
	ФайлОтправки.Записать(стрJSON);
	ФайлОтправки.Закрыть();
	
	//Размер файла
	имяФайлаОтправки = ВремКаталог + "test.txt"; // файл с отсылаемыми для обработки данными
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("/auth", Заголовки);
	
	HTTPЗапрос.УстановитьИмяФайлаТела(имяФайлаОтправки);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "не удалось прочитать JSON");
		ЧтениеJSON.Закрыть();
		Возврат;
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Если Ответ.КодСостояния = 200 Тогда
		ИдентификаторСессии = СтруктураОтвета.result;
	Иначе
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
	КонецЕсли;
	
КонецПроцедуры

Процедура Разлогиниться() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		Возврат;
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("/logout/" + ИдентификаторСессии , Заголовки);
	
	HTTPЗапрос.УстановитьТелоИзСтроки("");
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
		Возврат;
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Если Ответ.КодСостояния = 200 Тогда
	Иначе
		ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКатегории() Экспорт
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("/categories/" + ИдентификаторСессии, Заголовки);
	
	Ответ 	= Соединение.Получить(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();	
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		
		Попытка
			СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);;
		Исключение
			ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось прочитать JSON");	
			Возврат;
		КонецПопытки;
		
		Если СтруктураJSON.Свойство("status") Тогда
			
			Если СтруктураJSON.status = 0 Тогда
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, СтруктураJSON.error_message);	
				Возврат;
			КонецЕсли;
			
			Если СтруктураJSON.Свойство("result") Тогда
				
				Для Каждого стрДанные из СтруктураJSON.result Цикл
					
					НовСтр 				= Категории.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, стрДанные);
					НовСтр.categoryID 	= СтрЗаменить(стрДанные.categoryID, Символы.НПП, "");
					НовСтр.parentID		= СтрЗаменить(стрДанные.parentID, Символы.НПП, "");
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьКатегорииВБазу() Экспорт
	
	Для Каждого стрДанные из Категории Цикл
		
		id = СтрЗаменить(стрДанные.categoryID, Символы.НПП, "");
		НайденнаяКатегория = НайтиКатегориюПоID(стрДанные.name, id);
		
		Если НЕ ЗначениеЗаполнено(НайденнаяКатегория) Тогда
			СоздатьГруппы(стрДанные.name, стрДанные.categoryID);
		КонецЕсли;
		
	КонецЦикла;
	
	ПроставитьРодителей();
	
КонецПроцедуры

Процедура ЗаполнитьПроизводителей() Экспорт
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	тзКатегории = ПолучитьВсеКатегории();
	
	Для каждого Категория из тзКатегории Цикл
		
		//таймаут	
		Таймаут();
		
		HTTPЗапрос = Новый HTTPЗапрос("/vendors/" +Категория.ID +"/" + ИдентификаторСессии, Заголовки);
		
		Ответ 	= Соединение.Получить(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();	
		
		Если Ответ.КодСостояния = 200 Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(мОтвет);
			
			Попытка
				СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);;
			Исключение
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось прочитать JSON");	
				Продолжить;
			КонецПопытки;
			
			Если СтруктураJSON.Свойство("status") Тогда
				
				Если СтруктураJSON.status = 0 Тогда
					ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, СтруктураJSON.error_message);	
					Продолжить;
				КонецЕсли;
				
				Если СтруктураJSON.Свойство("result") Тогда
					
					Для Каждого стрДанные из СтруктураJSON.result Цикл
						
						НовСтр 				= Производители.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, стрДанные);
						НовСтр.vendorID 		= СтрЗаменить(стрДанные.vendorID, Символы.НПП, "");
						НовСтр.КатегорияCerebro = Категория.Ссылка;
						
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,,мОтвет);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьПроизводителейВБазу() Экспорт
	Для Каждого стрПроизводитель из Производители Цикл
		НайденныйПроизводитель = НайтиПроизводителяПоID(стрПроизводитель.name, стрПроизводитель.vendorID);
		Если НЕ ЗначениеЗаполнено(НайденныйПроизводитель) Тогда
			СоздатьПроизводителя(стрПроизводитель.КатегорияCerebro, стрПроизводитель.name, стрПроизводитель.vendorID);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТовары() Экспорт
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	тзКатегории = ПолучитьВсеКатегории();
	
	Для Каждого Категория из тзКатегории Цикл
		
		Таймаут();
		
		HTTPЗапрос = Новый HTTPЗапрос("/products/" + Категория.ID + "/" + ИдентификаторСессии, Заголовки);
		
		Ответ 	= Соединение.Получить(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
			Продолжить;
		КонецЕсли;
		
		ЗначениеУзла = "";
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
		
		Пока ЧтениеJSON.Прочитать() Цикл
			
			ТипЗначения = ЧтениеJSON.ТипТекущегоЗначения;
			
			Если ТипЗначения = ТипЗначенияJSON.НачалоОбъекта Тогда
				
				Если ЗначениеЗаполнено(ЗначениеУзла)  //возвращает не правильный json. тут должен быть массив, а возвращает как новый объект { }
					И ЗначениеУзла <> "available" 
					И ЗначениеУзла <> "result" 
					И ЗначениеУзла <> "stocks_expected" 
					Тогда
					НовСтр = Товары.Добавить();
				КонецЕсли;
				
			ИначеЕсли ТипЗначения = ТипЗначенияJSON.НачалоМассива Тогда
			ИначеЕсли ТипЗначения = ТипЗначенияJSON.ИмяСвойства
				ИЛИ ТипЗначения = ТипЗначенияJSON.Строка
				ИЛИ ТипЗначения = ТипЗначенияJSON.Число
				ИЛИ ТипЗначения = ТипЗначенияJSON.Булево
				ИЛИ ТипЗначения = ТипЗначенияJSON.Null Тогда
				
				Значение = ЧтениеJSON.ТекущееЗначение;
				
				Если ЗначениеУзла = "name" Тогда
					НовСтр.name_ru = Значение;
				ИначеЕсли ЗначениеУзла = "brief_description" Тогда
					НовСтр.brief_description = Значение;
				ИначеЕсли ЗначениеУзла = "description" Тогда
					НовСтр.description = Значение;
				ИначеЕсли ЗначениеУзла = "country" Тогда
					НовСтр.country = Значение;
				ИначеЕсли ЗначениеУзла = "product_code" Тогда
					НовСтр.product_code = Значение;
				ИначеЕсли ЗначениеУзла = "date_added" Тогда
					НовСтр.date_added = Значение;
				ИначеЕсли ЗначениеУзла = "date_last_change" Тогда
					НовСтр.date_last_change = Значение;
				ИначеЕсли ЗначениеУзла = "date_last_price_change" Тогда
					НовСтр.date_last_price_change = Значение;
				ИначеЕсли ЗначениеУзла = "date_last_change_description" Тогда
					НовСтр.date_last_change_description = Значение;
				ИначеЕсли ЗначениеУзла = "warranty" Тогда
					НовСтр.warranty = Значение;
				ИначеЕсли ЗначениеУзла = "is_archive" Тогда
					НовСтр.is_archive = Значение;
				ИначеЕсли ЗначениеУзла = "is_exclusive" Тогда
					НовСтр.is_exclusive = Значение;
				ИначеЕсли ЗначениеУзла = "productID" Тогда
					НовСтр.productID = СтрЗаменить(Значение, Символы.НПП, "");
				ИначеЕсли ЗначениеУзла = "vendorID" Тогда
					НовСтр.vendorID = СтрЗаменить(Значение, Символы.НПП, "");
				ИначеЕсли ЗначениеУзла = "articul" Тогда
					НовСтр.articul = Значение;
				ИначеЕсли ЗначениеУзла = "categoryID" Тогда
					НовСтр.categoryID = СтрЗаменить(Значение, Символы.НПП, "");
				ИначеЕсли ЗначениеУзла = "small_image" Тогда
					НовСтр.small_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "medium_image" Тогда
					НовСтр.medium_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "large_image" Тогда
					НовСтр.large_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "full_image" Тогда
					НовСтр.full_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "price" Тогда
					НовСтр.price = Значение;
				ИначеЕсли ЗначениеУзла = "price_uah" Тогда
					НовСтр.price_uah = Значение;
				ИначеЕсли ЗначениеУзла = "recommendable_price" Тогда
					НовСтр.recommendable_price = Значение;
				ИначеЕсли ЗначениеУзла = "retail_price_uah" Тогда
					НовСтр.retail_price_uah = Значение;
				КонецЕсли;
				
				ЗначениеУзла = ЧтениеJSON.ТекущееЗначение;
				
			КонецЕсли;			
			
		КонецЦикла;
		
		ЧтениеJSON.Закрыть();
		
		ЗаполнитьНаименованиеУкр();
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьТоварыИзБазы1с() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	Номенклатура.IDCerebro,
	|	Номенклатура.АртикулПоставщика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Родитель = &РодительЦеребро";
	
	Запрос.УстановитьПараметр("РодительЦеребро", Справочники.Номенклатура.НайтиПоНаименованию("Cerebro", Истина));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовСтр 				= Товары.Добавить();
		НовСтр.articul 		= ВыборкаДетальныеЗаписи.АртикулПоставщика;
		НовСтр.productID 	= ВыборкаДетальныеЗаписи.IDCerebro;
		НовСтр.name_ua		= ВыборкаДетальныеЗаписи.Наименование;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапонитьТоварыПоЕксель(Данные) Экспорт
	
	ДатаНач = ТекущаяДата();
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	Для Каждого стрТовар из Данные Цикл
		
		Если НЕ ЗначениеЗаполнено(стрТовар.Артикул) Тогда
			Продолжить;
		КонецЕсли;
		
		Таймаут();
		
		HTTPЗапрос = Новый HTTPЗапрос("/product/articul/" + стрТовар.Артикул + "/" + ИдентификаторСессии, Заголовки);
		
		Ответ 	= Соединение.Получить(HTTPЗапрос);	
		мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет + " " +стрТовар.Артикул);
			Сообщить(мОтвет + " " + стрТовар.Артикул);
			Продолжить;
		КонецЕсли;
		
		ЗначениеУзла = "";
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
		
		Пока ЧтениеJSON.Прочитать() Цикл
			
			ТипЗначения = ЧтениеJSON.ТипТекущегоЗначения;
			
			Если ТипЗначения = ТипЗначенияJSON.НачалоОбъекта Тогда
				
				Если ЗначениеУзла = "result" Тогда
					НовСтр = Товары.Добавить();
				КонецЕсли;
				
				Если ЗначениеУзла = "options" Тогда
					Прервать;	
				КонецЕсли;
				
			ИначеЕсли ТипЗначения = ТипЗначенияJSON.НачалоМассива Тогда
			ИначеЕсли ТипЗначения = ТипЗначенияJSON.ИмяСвойства
				ИЛИ ТипЗначения = ТипЗначенияJSON.Строка
				ИЛИ ТипЗначения = ТипЗначенияJSON.Число
				ИЛИ ТипЗначения = ТипЗначенияJSON.Булево
				ИЛИ ТипЗначения = ТипЗначенияJSON.Null Тогда
				
				Значение = ЧтениеJSON.ТекущееЗначение;
				
				Если ЗначениеУзла = "name" Тогда
					НовСтр.name_ru = Значение;
				ИначеЕсли ЗначениеУзла = "brief_description" Тогда
					НовСтр.brief_description = Значение;
				ИначеЕсли ЗначениеУзла = "description" Тогда
					НовСтр.description = Значение;
				ИначеЕсли ЗначениеУзла = "country" Тогда
					НовСтр.country = Значение;
				ИначеЕсли ЗначениеУзла = "product_code" Тогда
					НовСтр.product_code = Значение;
				ИначеЕсли ЗначениеУзла = "date_added" Тогда
					НовСтр.date_added = Значение;
				ИначеЕсли ЗначениеУзла = "date_last_change" Тогда
					НовСтр.date_last_change = Значение;
				ИначеЕсли ЗначениеУзла = "date_last_price_change" Тогда
					НовСтр.date_last_price_change = Значение;
				ИначеЕсли ЗначениеУзла = "date_last_change_description" Тогда
					НовСтр.date_last_change_description = Значение;
				ИначеЕсли ЗначениеУзла = "warranty" Тогда
					НовСтр.warranty = Значение;
				ИначеЕсли ЗначениеУзла = "is_archive" Тогда
					НовСтр.is_archive = Значение;
				ИначеЕсли ЗначениеУзла = "is_exclusive" Тогда
					НовСтр.is_exclusive = Значение;
				ИначеЕсли ЗначениеУзла = "productID" Тогда
					НовСтр.productID = СтрЗаменить(Значение, Символы.НПП, "");
				ИначеЕсли ЗначениеУзла = "vendorID" Тогда
					НовСтр.vendorID = СтрЗаменить(Значение, Символы.НПП, "");
				ИначеЕсли ЗначениеУзла = "artikul" Тогда
					НовСтр.articul = Значение;
				ИначеЕсли ЗначениеУзла = "categoryID" Тогда
					НовСтр.categoryID = СтрЗаменить(Значение, Символы.НПП, "");
				ИначеЕсли ЗначениеУзла = "small_image" Тогда
					НовСтр.small_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "medium_image" Тогда
					НовСтр.medium_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "large_image" Тогда
					НовСтр.large_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "full_image" Тогда
					НовСтр.full_image = СтрЗаменить(Значение, "https://source.dclink.com.ua/images/", "");
				ИначеЕсли ЗначениеУзла = "price" Тогда
					НовСтр.price = Значение;
				ИначеЕсли ЗначениеУзла = "price_uah" Тогда
					НовСтр.price_uah = Значение;
				ИначеЕсли ЗначениеУзла = "recommendable_price" Тогда
					НовСтр.recommendable_price = Значение;
				ИначеЕсли ЗначениеУзла = "retail_price_uah" Тогда
					НовСтр.retail_price_uah = Значение;
				КонецЕсли;
				
				ЗначениеУзла = ЧтениеJSON.ТекущееЗначение;
				
			КонецЕсли;			
			
		КонецЦикла;
		
		ЧтениеJSON.Закрыть();
		
	КонецЦикла;
	
	ЗаполнитьНаименованиеУкр();
	
	тзДанные = Товары.Выгрузить();
	тзДанные.ЗаполнитьЗначения(Ложь, "Отметка");
	Товары.Загрузить(тзДанные);
	ЗаполнитьДопСвойства();
	ЗаписатьТоварыВБазу();
	
	Сообщить("Время выполнения - " + Строка((ДатаНач - ТекущаяДата()) * -1 /60) + " минут");
	
КонецПроцедуры

Процедура ЗаполнитьДопСвойства() Экспорт
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	стрОтбор = Новый Структура;
	стрОтбор.Вставить("Отметка", Ложь);
	тзДанные = Товары.НайтиСтроки(стрОтбор); 
	
	Для Каждого стрТовар из тзДанные Цикл
		
		Таймаут();
		
		Если ЗначениеЗаполнено(стрТовар.productID) Тогда
			HTTPЗапрос = Новый HTTPЗапрос("/product_options/" + стрТовар.productID + "/" + ИдентификаторСессии + "?lang=ua", Заголовки);
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
			Если Ответ.КодСостояния = 200 Тогда
				
				ЧтениеJSONДопСвойства = Новый ЧтениеJSON;
				ЧтениеJSONДопСвойства.УстановитьСтроку(мОтвет);
				
				Попытка
					СтрJSON = ПрочитатьJSON(ЧтениеJSONДопСвойства);
					Если СтрJSON.Свойство("error_message")
						И СтрJSON.error_message = "Session identifier is fault" Тогда
						Залогиниться();
						ЗаполнитьДопСвойства();
					КонецЕсли;
				Исключение КонецПопытки;
				
				Попытка
					Если ТипЗнч(СтрJSON) = Тип("Структура")
						И СтрJSON.Свойство("result") Тогда
					Иначе
						СтрJson = ПрочитатьJSON(ЧтениеJSONДопСвойства);
					КонецЕсли;
					стрТовар.ДопСвойстваJSON = ЗначениеВСтрокуВнутр(СтрJson.result);
					стрТовар.Отметка = Истина;
				Исключение
					ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "не удалось прочитать доп свойства. product id " + стрТовар.productID);
				КонецПопытки;
				
				ЧтениеJSONДопСвойства.Закрыть();
				
			Иначе
				Сообщить(Ответ.КодСостояния);
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьТоварыВБазу() Экспорт
	
	СтрПараметрыПодключения = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("Cerebro");
	
	грЦеребро = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("c0cf815d-7355-11ee-bf32-00155d0a1408"));	
	
	ТЗНоменклатураИЦены = Новый ТаблицаЗначений;
	ТЗНоменклатураИЦены.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗНоменклатураИЦены.Колонки.Добавить("ЦенаРРЦ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТЗНоменклатураИЦены.Колонки.Добавить("ЦенаДилер", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

	Для Каждого стрНоменклатура из Товары Цикл
		
		НайденнаяНоменклатура = НайтиНоменклатуруПоАртикулу(стрНоменклатура.articul);
		
		Если ЗначениеЗаполнено(НайденнаяНоменклатура) Тогда
			Продолжить;	
		КонецЕсли;
			//	номОбъект = НайденнаяНоменклатура.ПолучитьОбъект();
			//Иначе
			номОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			//КонецЕсли;
			
			номОбъект.Родитель = грЦеребро;
			
			номОбъект.АртикулПоставщика 	= стрНоменклатура.articul;
			номОбъект.КатегорияCerebro 		= Справочники.КатегорииCerebro.НайтиПоРеквизиту("ID", стрНоменклатура.categoryID);
			номОбъект.Наименование 			= стрНоменклатура.name_ua;
			номОбъект.Наименование_ru 		= стрНоменклатура.name_ru;
			номОбъект.НаименованиеПолное    = стрНоменклатура.name_ua;
			номОбъект.IDCerebro 			= СтрЗаменить(стрНоменклатура.productID, Символы.НПП, "");
			номОбъект.ПроизводительCerebro 	= Справочники.ПроизводителиCerebro.НайтиПоРеквизиту("ID", стрНоменклатура.vendorID);
			номОбъект.ВидНоменклатуры		= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар", Истина);
			
			Если НЕ ЗначениеЗаполнено(номОбъект.БазоваяЕдиницаИзмерения) тогда
				
				номОбъект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
				
				Попытка
					номОбъект.Записать();
				Исключение
					Таймаут();
					Попытка
						номОбъект.Записать();
					Исключение
						ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось записать номенклатуру " + стрНоменклатура.articul);	
						Продолжить;
					КонецПопытки;
				КонецПопытки;
				
				НовЕдиница 				= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
				НовЕдиница.Наименование = "шт";
				НовЕдиница.Владелец 	= номОбъект.Ссылка;
				НовЕдиница.Вес 			= стрНоменклатура.weight;
				НовЕдиница.Коэффициент  = 1;
				НовЕдиница.ЕдиницаПоКлассификатору = номОбъект.БазоваяЕдиницаИзмерения;
				НовЕдиница.Записать();
				
				номОбъект.ЕдиницаДляОтчетов 		= НовЕдиница.Ссылка;
				номОбъект.ЕдиницаХраненияОстатков 	= НовЕдиница.Ссылка;
				
			КонецЕсли;
			
			//Попытка
			//	номОбъект.Записать();
			//Исключение
			//	Таймаут();
			//	Попытка
			//		номОбъект.Записать();
			//	Исключение
			//	КонецПопытки;
			//КонецПопытки;
			
			//Доп свойства
			ДопСвойства = Обработки.ЗначенияСвойствОбъекта.Создать();
			ДопСвойства.ОбъектОтбораЗначений = номОбъект.Ссылка;
			ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
			
			Для Каждого ДопСвойство из СтрПараметрыПодключения.ДопСвойства Цикл
				
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(ДопСвойство.ДопСвойство)); 
				
				НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					НайденныеСтроки[0].Значение = стрНоменклатура[ДопСвойство.ДопСвойство];	
					
				Иначе
					
					НовСвойство 					= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
					НовСвойство.Наименование 		= ДопСвойство.ДопСвойство;
					НовСвойство.Наименование_en 	= ДопСвойство.ДопСвойство;
					НовСвойство.Наименование_ru 	= ДопСвойство.ДопСвойство;
					НовСвойство.НазначениеСвойства 	= ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
					
					//НовСтрока = Новый ОписаниеТипов("Строка");
					//КвалификаторыСтроки = Новый КвалификаторыСтроки(50);
					//НовСтрока_50 = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);				
					
					
					НовСвойство.ТипЗначения	= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);
					НовСвойство.Записать();
					
					СтрПоиска = Новый Структура;
					СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(ДопСвойство.ДопСвойство)); 
					
					ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
					
					НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						НайденныеСтроки[0].Значение = стрНоменклатура[ДопСвойство.ДопСвойство];	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДопСвойства.ЗаписатьЗначенияСвойств();
			
			Попытка
				ДопСвойстваПродукта = ЗначениеИзСтрокиВнутр(стрНоменклатура.ДопСвойстваJSON);
				Для Каждого ДопСвойство из ДопСвойстваПродукта Цикл
					
					СтрПоиска = Новый Структура;
					СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(ДопСвойство.name)); 
					СтрПоиска.Вставить("ПометкаУдаления", Ложь);
					
					НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						НайденныеСтроки[0].Значение = ДопСвойство.value;	
						
					Иначе
						
						НовСвойство 					= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
						НовСвойство.Наименование 		= ДопСвойство.name;
						НовСвойство.Наименование_en 	= ДопСвойство.name;
						НовСвойство.Наименование_ru 	= ДопСвойство.name;
						НовСвойство.НазначениеСвойства 	= ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
						НовСвойство.ТипЗначения			= ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);;
						НовСвойство.Записать();
						
						СтрПоиска = Новый Структура;
						СтрПоиска.Вставить("Свойство", ПолучитьСвойствоНоменклатуры(ДопСвойство.name));
						СтрПоиска.Вставить("ПометкаУдаления", Ложь);
						
						ДопСвойства.ПрочитатьЗаполнитьСвойстваИЗначения();
						
						НайденныеСтроки = ДопСвойства.СвойстваИЗначения.НайтиСтроки(СтрПоиска);
						
						Если НайденныеСтроки.Количество() > 0 Тогда
							НайденныеСтроки[0].Значение = ДопСвойство.value;	
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ДопСвойства.ЗаписатьЗначенияСвойств();
				
			Исключение
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось прочитать JSON. " + стрНоменклатура.ДопСвойстваJSON);
			КонецПопытки;
			
			
			//Изображение
			Если НЕ ЗначениеЗаполнено(номОбъект.Ссылка) Тогда
				Попытка
					номОбъект.Записать();
				Исключение
					Таймаут();
					Попытка
						номОбъект.Записать();
					Исключение
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;
			
			НайденноеИзображение = НайтиИзображение(номОбъект.Ссылка);
			
			Если НЕ ЗначениеЗаполнено(НайденноеИзображение) Тогда
				НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
			Иначе
				НовыйОбъект = НайденноеИзображение.ПолучитьОбъект();
			КонецЕсли;
			
			Таймаут();
			
			HTTPСоединение = Новый HTTPСоединение("source.dclink.com.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
			HTTPЗапрос = Новый HTTPЗапрос("images/"+ стрНоменклатура.full_image); 
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
			
			Если HTTPОтвет.КодСостояния = 200 Тогда
				ДвоичныеДанныеКартинки = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
				ВыбранноеИзображение = Новый Картинка(ДвоичныеДанныеКартинки);
				
				НовыйОбъект.ВидДанных 		= Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
				НовыйОбъект.Хранилище 		= Новый ХранилищеЗначения(ВыбранноеИзображение, Новый СжатиеДанных);
				НовыйОбъект.Объект 			= номОбъект.Ссылка;
				НовыйОбъект.ИмяФайла		= стрНоменклатура.full_image;
				НовыйОбъект.Наименование	= стрНоменклатура.full_image;
				НовыйОбъект.Записать();
				номОбъект.ОсновноеИзображение = НовыйОбъект.Ссылка;
				
			Иначе
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось получить изображение " + стрНоменклатура.articul);	
			КонецЕсли;
			
			Попытка
				номОбъект.Записать();
			Исключение
				Таймаут();
				Попытка
					номОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецПопытки;
	КонецЦикла;		
			//Цены
	//		Если стрНоменклатура.retail_price_uah = "" Тогда
	//			Попытка
	//				номОбъект.Записать();
	//			Исключение
	//				Таймаут();
	//				Попытка
	//					номОбъект.Записать();
	//				Исключение
	//					ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось записать номенклатуру " + стрНоменклатура.articul);	
	//					Продолжить; 
	//				КонецПопытки;
	//			КонецПопытки;
	//			Продолжить;
	//		КонецЕсли;
	//		
	//				
	//		Попытка
	//			номОбъект.Записать();
	//		Исключение
	//			Таймаут();
	//			Попытка
	//				номОбъект.Записать();
	//			Исключение
	//				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось записать номенклатуру " + стрНоменклатура.articul);	
	//				Продолжить;
	//			КонецПопытки;
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//	НовСтрНоменклатураЦена 				= ТЗНоменклатураИЦены.Добавить();
	//	НовСтрНоменклатураЦена.Номенклатура = номОбъект.Ссылка;
	//	Попытка
	//		НовСтрНоменклатураЦена.ЦенаРРЦ 	 = Число(СтрЗаменить(СтрЗаменить(стрНоменклатура.retail_price_uah, " ", ""), Символы.НПП, ""));
	//		НовСтрНоменклатураЦена.ЦенаДилер = Число(СтрЗаменить(СтрЗаменить(стрНоменклатура.retail_price_uah, " ", ""), Символы.НПП, ""));

	//	Исключение
	//		Сообщить(ОписаниеОшибки());
	//	КонецПопытки;
	//	
	//КонецЦикла;
	//
	////Цены
	//ТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("d26f9475-256a-11ee-bf23-00155d0a1408")); //Интернет магазин
	//НужноСоздатьДокументУстановкиЦен = Ложь;
	//
	//ДанныеНоменклатураИЦена = ПолучитьНоменеклатуруДляУстановкиЦены(ТЗНоменклатураИЦены, ТипЦен);
	//
	//Если ДанныеНоменклатураИЦена.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДокУстановкиЦен 		= Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	//
	//ДокУстановкиЦен.Дата 	= ТекущаяДата();
	//НовСтрТипЦен 			= ДокУстановкиЦен.ТипыЦен.Добавить();
	//НовСтрТипЦен.ТипЦен 	= ТипЦен;
	//
	//Для Каждого стрТовар из ДанныеНоменклатураИЦена Цикл
	//	НовСтрТовары 					= ДокУстановкиЦен.Товары.Добавить();
	//	НовСтрТовары.Номенклатура 		= стрТовар.Номенклатура;
	//	НовСтрТовары.Валюта 			= мВалютаРегламентированногоУчета;
	//	НовСтрТовары.ЕдиницаИзмерения 	= стрТовар.Номенклатура.ЕдиницаХраненияОстатков;
	//	НовСтрТовары.ТипЦен 			= ТипЦен;
	//	НовСтрТовары.Цена 				= стрТовар.Цена;
	//КонецЦикла;
	//
	//Попытка
	//	ДокУстановкиЦен.Записать(РежимЗаписиДокумента.Проведение);
	//Исключение
	//	ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось провести документ установки цен " + ОписаниеОшибки());	
	//КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьНаименованиеУкр() Экспорт
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	стрОтбор = Новый Структура;
	стрОтбор.Вставить("Отметка", Ложь);
	тзДанные = Товары.НайтиСтроки(стрОтбор); 
	
	Для Каждого стрТовар из тзДанные Цикл
		
		Таймаут();
		
		Если ЗначениеЗаполнено(стрТовар.productID) Тогда
			HTTPЗапрос = Новый HTTPЗапрос("/product/" + стрТовар.productID + "/" + ИдентификаторСессии + "?lang=ua", Заголовки);
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
			Если Ответ.КодСостояния = 200 Тогда
				
				ЗначениеУзла = "";
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
				
				Попытка
					СтрJSON = ПрочитатьJSON(ЧтениеJSON);
					Если СтрJSON.Свойство("error_message")
						И СтрJSON.error_message = "Session identifier is fault" Тогда
						Залогиниться();
						ЗаполнитьНаименованиеУкр();
					КонецЕсли;
				Исключение КонецПопытки;
				
				
				Пока ЧтениеJSON.Прочитать() Цикл
					
					ТипЗначения = ЧтениеJSON.ТипТекущегоЗначения;
					
					Если ТипЗначения = ТипЗначенияJSON.НачалоОбъекта Тогда						
					ИначеЕсли ТипЗначения = ТипЗначенияJSON.НачалоМассива Тогда
					ИначеЕсли ТипЗначения = ТипЗначенияJSON.ИмяСвойства
						ИЛИ ТипЗначения = ТипЗначенияJSON.Строка
						ИЛИ ТипЗначения = ТипЗначенияJSON.Число
						ИЛИ ТипЗначения = ТипЗначенияJSON.Булево
						ИЛИ ТипЗначения = ТипЗначенияJSON.Null Тогда
						
						Значение = ЧтениеJSON.ТекущееЗначение;
						
						Если ЗначениеУзла = "name" Тогда
							стрТовар.name_ua = Значение;
							Прервать;
						КонецЕсли;
						
						ЗначениеУзла = ЧтениеJSON.ТекущееЗначение;
						
					КонецЕсли;			
					
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(стрТовар.name_ua) И ТипЗнч(СтрJSON) = Тип("Структура") 
					И СтрJSON.Свойство("result") И ТипЗнч(СтрJSON.result) = Тип("Структура") Тогда
					стрТовар.name_ua = СтрJSON.result.name;			
				КонецЕсли;
				
				ЧтениеJSON.Закрыть();
				
				стрТовар.Отметка = Истина;
				
			Иначе
				
				Если ЗначениеЗаполнено(стрТовар.articul) Тогда
					HTTPЗапрос = Новый HTTPЗапрос("/product/articul/" + стрТовар.articul + "/" + ИдентификаторСессии + "?lang=ua", Заголовки);
					Ответ 	= Соединение.Получить(HTTPЗапрос);	
					мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
					Если Ответ.КодСостояния = 200 Тогда
						
						ЗначениеУзла = "";
						
						ЧтениеJSON = Новый ЧтениеJSON;
						ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
						
						Попытка
							СтрJSON = ПрочитатьJSON(ЧтениеJSON);
							Если СтрJSON.Свойство("error_message")
								И СтрJSON.error_message = "Session identifier is fault" Тогда
								Залогиниться();
								ЗаполнитьНаименованиеУкр();
							КонецЕсли;
						Исключение КонецПопытки;
						
						
						Пока ЧтениеJSON.Прочитать() Цикл
							
							ТипЗначения = ЧтениеJSON.ТипТекущегоЗначения;
							
							Если ТипЗначения = ТипЗначенияJSON.НачалоОбъекта Тогда						
							ИначеЕсли ТипЗначения = ТипЗначенияJSON.НачалоМассива Тогда
							ИначеЕсли ТипЗначения = ТипЗначенияJSON.ИмяСвойства
								ИЛИ ТипЗначения = ТипЗначенияJSON.Строка
								ИЛИ ТипЗначения = ТипЗначенияJSON.Число
								ИЛИ ТипЗначения = ТипЗначенияJSON.Булево
								ИЛИ ТипЗначения = ТипЗначенияJSON.Null Тогда
								
								Значение = ЧтениеJSON.ТекущееЗначение;
								
								Если ЗначениеУзла = "name" Тогда
									стрТовар.name_ua = Значение;
									Прервать;
								КонецЕсли;
								
								ЗначениеУзла = ЧтениеJSON.ТекущееЗначение;
								
							КонецЕсли;			
							
						КонецЦикла;
						
						Если НЕ ЗначениеЗаполнено(стрТовар.name_ua) И ТипЗнч(СтрJSON) = Тип("Структура") 
							И СтрJSON.Свойство("result") И ТипЗнч(СтрJSON.result) = Тип("Структура") Тогда
							стрТовар.name_ua = СтрJSON.result.name;			
						КонецЕсли;
						
						ЧтениеJSON.Закрыть();
						
						стрТовар.Отметка = Истина;
					Иначе
						
						Сообщить(Ответ.КодСостояния);
						ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьВсеИзображенияПоНоменклатуре() Экспорт
	
	Соединение = Новый HTTPСоединение(Url,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json");
	
	Для Каждого стрТовар из Товары Цикл
		
		Таймаут();
		
		Если ЗначениеЗаполнено(стрТовар.productID) Тогда
			HTTPЗапрос = Новый HTTPЗапрос("/product_pictures/" + стрТовар.productID + "/" + ИдентификаторСессии + "?lang=ua", Заголовки);
			Ответ 	= Соединение.Получить(HTTPЗапрос);	
			мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
			Если Ответ.КодСостояния = 200 Тогда
				
				ЗначениеУзла = "";
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(мОтвет); //сделал именно так, т.к. возвращают не читаемую структуру json. например stocks: [253].
				
				Попытка 
					СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);					
				Исключение
					Сообщить("Не удалось прочитать JSON " + мОтвет);
					Возврат;
				КонецПопытки;
				ЧтениеJSON.Закрыть();
				
			Иначе
				Сообщить(Ответ.КодСостояния);
				ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, мОтвет);
			КонецЕсли;
			
			Если СтруктураJSON.Свойство("status") Тогда
				
				Если СтруктураJSON.status = 0 Тогда
					ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, СтруктураJSON.error_message);	
					Возврат;
				КонецЕсли;
				
				Если СтруктураJSON.Свойство("result") Тогда
					
					Номенклаутра = НайтиНоменклатуруПоАртикулу(стрТовар.articul);
					
					Для Каждого стрДанные из СтруктураJSON.result Цикл
						
						Таймаут();
						
						НаименованиеИзображения = СтрЗаменить(стрДанные.full_image, "https://source.dclink.com.ua/images/", "");
						
						HTTPСоединение = Новый HTTPСоединение("source.dclink.com.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
						HTTPЗапрос = Новый HTTPЗапрос("images/"+ НаименованиеИзображения); 
						HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
						
						НайденноеИзображение = НайтиИзображениеПоНаименованию(Номенклаутра, НаименованиеИзображения);
						
						Если НЕ ЗначениеЗаполнено(НайденноеИзображение) Тогда
							НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
						Иначе
							НовыйОбъект = НайденноеИзображение.ПолучитьОбъект();
						КонецЕсли;
						
						Если HTTPОтвет.КодСостояния = 200 Тогда
							ДвоичныеДанныеКартинки = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
							ВыбранноеИзображение = Новый Картинка(ДвоичныеДанныеКартинки);
							
							НовыйОбъект.ВидДанных 		= Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
							НовыйОбъект.Хранилище 		= Новый ХранилищеЗначения(ВыбранноеИзображение, Новый СжатиеДанных);
							НовыйОбъект.Объект 			= Номенклаутра;
							НовыйОбъект.ИмяФайла		= стрТовар.full_image;
							НовыйОбъект.Наименование	= НаименованиеИзображения;
							НовыйОбъект.Записать();
							
						Иначе
							ЗаписьЖурналаРегистрации("Cerebro", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось получить изображение " + стрТовар.articul);	
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура Таймаут()
	
	//таймаут	
	ДатаКон = ТекущаяДата() + 1;//пауза 2 сек
	Пока ТекущаяДата() < ДатаКон Цикл КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСвойствоНоменклатуры(ИмяСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Наименование = &Наименование
	|	И НЕ СвойстваОбъектов.ПометкаУдаления
	|	И СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
	Запрос.УстановитьПараметр("Наименование", ИмяСвойства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено	
	
КонецФункции

Функция НайтиНоменклатуруПоАртикулу(АртикулПоставщика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.АртикулПоставщика = &АртикулПоставщика
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("АртикулПоставщика", АртикулПоставщика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиКатегориюПоID(Name = Неопределено, Id)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииCerebro.Ссылка
	|ИЗ
	|	Справочник.КатегорииCerebro КАК КатегорииCerebro
	|ГДЕ
	|	НЕ КатегорииCerebro.ПометкаУдаления
	|	И КатегорииCerebro.ID = &ID"
	+?(Name = Неопределено, "", Символы.ПС+ "И КатегорииCerebro.Наименование = &name");
	
	Запрос.УстановитьПараметр("ID", Id);
	Запрос.УстановитьПараметр("name", Name);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиПроизводителяПоID(Name, Id)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводителиCerebro.Ссылка
	|ИЗ
	|	Справочник.ПроизводителиCerebro КАК ПроизводителиCerebro
	|ГДЕ
	|	НЕ ПроизводителиCerebro.ПометкаУдаления
	|	И ПроизводителиCerebro.ID = &ID
	|	И ПроизводителиCerebro.Наименование = &name";
	
	Запрос.УстановитьПараметр("ID", Id);
	Запрос.УстановитьПараметр("name", Name);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиИзображение(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления
	|	И ХранилищеДополнительнойИнформации.Объект = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиИзображениеПоНаименованию(Номенклатура, ПолныйПуть)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления
	|	И ХранилищеДополнительнойИнформации.Объект = &Номенклатура
	|	И ХранилищеДополнительнойИнформации.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Наименование", ПолныйПуть);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьНоменеклатуруДляУстановкиЦены(ТЗНоменклатураИЦены, ТипЦен)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураИЦена.Номенклатура,
	|	НоменклатураИЦена.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ТЗНоменклатураИЦены КАК НоменклатураИЦена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	УстановкаЦенНоменклатурыТовары.Ссылка,
	|	УстановкаЦенНоменклатурыТовары.Номенклатура,
	|	УстановкаЦенНоменклатурыТовары.Цена
	|ПОМЕСТИТЬ ВТ_УстановкаЦен
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	|ГДЕ
	|	НЕ УстановкаЦенНоменклатурыТовары.Ссылка.ПометкаУдаления
	|	И УстановкаЦенНоменклатурыТовары.Ссылка.Проведен
	|	И УстановкаЦенНоменклатурыТовары.ТипЦен = &ТипЦен
	|	И УстановкаЦенНоменклатурыТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТ_Данные.Номенклатура
	|			ИЗ
	|				ВТ_Данные КАК ВТ_Данные)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УстановкаЦенНоменклатурыТовары.Ссылка.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Номенклатура,
	|	ВТ_Данные.Цена,
	|	ВЫБОР
	|		КОГДА ВТ_Данные.Цена <> ЕСТЬNULL(ВТ_УстановкаЦен.Цена, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакОтбора
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УстановкаЦен КАК ВТ_УстановкаЦен
	|		ПО ВТ_Данные.Номенклатура = ВТ_УстановкаЦен.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Номенклатура,
	|	ВТ_Итог.Цена
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	ВТ_Итог.ПризнакОтбора";
	
	Запрос.УстановитьПараметр("ТЗНоменклатураИЦены", ТЗНоменклатураИЦены);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СоздатьГруппы(Name, Id)
	
	НовКатегория 				= Справочники.КатегорииCerebro.СоздатьЭлемент();
	НовКатегория.ID 			= Id;
	НовКатегория.Наименование 	= Name;
	НовКатегория.Записать();
	
КонецПроцедуры

Процедура СоздатьПроизводителя(КатегорияCerebro, Name, Id)
	
	НовКатегория 					= Справочники.ПроизводителиCerebro.СоздатьЭлемент();
	НовКатегория.ID 				= Id;
	НовКатегория.Наименование 		= Name;
	НовКатегория.КатегорияCerebro 	= КатегорияCerebro;
	НовКатегория.Записать();
	
КонецПроцедуры

Процедура ПроставитьРодителей()
	
	Для Каждого стрДанные из Категории Цикл
		
		Если стрДанные.parentID = "0" Тогда
			Продолжить;
		КонецЕсли;
		
		категорияОб = НайтиКатегориюПоID(стрДанные.name, стрДанные.categoryID).ПолучитьОбъект();			
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("categoryID", стрДанные.categoryID);
		
		НайденныеСтроки = Категории.НайтиСтроки(стрПоиска);
		
		
		категорияОб.Родитель = НайтиКатегориюПоID(,НайденныеСтроки[0].parentID);
		
		Если НЕ ЗначениеЗаполнено(категорияОб.Родитель) Тогда
			Сообщить("не найдена категория " + НайденныеСтроки[0].parentID);
			Продолжить;
		КонецЕсли;
		
		категорияОб.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьВсеКатегории()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииCerebro.ID,
	|	КатегорииCerebro.Ссылка
	|ИЗ
	|	Справочник.КатегорииCerebro КАК КатегорииCerebro
	|ГДЕ
	|	КатегорииCerebro.ID <> ""0""
	|	И НЕ КатегорииCerebro.ПометкаУдаления";
	//|	И КатегорииCerebro.Ссылка = &Ссылка";
	//|	И КатегорииCerebro.Родитель = ЗНАЧЕНИЕ(Справочник.КатегорииCerebro.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка", Справочники.КатегорииCerebro.НайтиПоНаименованию("Аудио", Истина));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
